Revit 2027 API
ExternalServices.BuiltInExternalServices.NavisworksExporterService Property
 The external service which supports export of the model to Navisworks.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId NavisworksExporterService { get; }
Public Shared ReadOnly Property NavisworksExporterService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ NavisworksExporterService {
	ExternalServiceId^ get ();
}
static member NavisworksExporterService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace